BEGIN = "Начнём общение"
MALE = "Парень"
FEMALE = "Девушка"
ACCEPT = "Принимаю правила"
RULES = "Читать правила полностью"
SEARCH = "Найти собеседника"
PROFILE = "Мой профиль"
SETTINGS = "Настройки поиска"
PREMIUM = "Premium"
STATS = "Статистика"
HELP = "Помощь"
MENU = "Меню"
NEXT = "Следующий"
STOP = "Стоп"
REPORT = "Пожаловаться"
REVEAL = "Раскрыть себя"
CANCEL = "Отменить поиск"
PAGE_NEXT = "Дальше"
PAGE_PREV = "Назад"
SYSTEM_TEXTS = {BEGIN, MALE, FEMALE, ACCEPT, RULES, SEARCH, PROFILE, SETTINGS,
                PREMIUM, STATS, HELP, MENU, NEXT, STOP, REPORT, REVEAL, CANCEL,
                PAGE_NEXT, PAGE_PREV}
MENU_TEXT = "<tg-emoji emoji-id=\"5257963315258204021\">🏠</tg-emoji> Главное меню\n\nНайди случайного собеседника и начинай общение <tg-emoji emoji-id=\"5350596259365273418\">👋</tg-emoji>"

EMOJI_IDS = {
    "Начнём общение": "5224455462178549802",
    "Парень": "5366121041426922772",
    "Девушка": "5366209534933089956",
    "Принимаю правила": "5348404473129614535",
    "Читать правила полностью": "5976791727934020069",
    "Найти собеседника": "5976789958407493804",
    "Мой профиль": "6032693626394382504",
    "Настройки поиска": "5348412779596365405",
    "Premium": "5258165702707125574",
    "Статистика": "5884336303415236350",
    "Помощь": "5805362626619774793",
    "Меню": "5257963315258204021",
    "Следующий": "5296587908906511469",
    "Стоп": "5398038979217989221",
    "Пожаловаться": "5460755126761312667",
    "Раскрыть себя": "5348232622898167572",
    "Отменить поиск": "5325971446625758812",
    "Дальше": "5260450573768990626",
    "Назад": "5258236805890710909",
}
